<template>
  <div class="mx-5 my-1">
    <v-card>
      <v-alert text color="teal" border="left" prominent dense>
        <span style="font-size:18px" class="ml-5">{{$t('incotermsTitle')}}</span>
      </v-alert>
    </v-card>
    <v-card>
      <v-simple-table>
        <thead>
          <tr>
            <th style="width: 10%">Code</th>
            <th>Definition</th>
          </tr>
        </thead>
        <tbody>
          <tr v-for="(rec,index) in IncotermList" :key="index">
            <td class="text-center text-nowrap">
              {{rec.code}}<br/>
              ({{rec.name}})
            </td>
            <td>
              {{rec.definition}}
            </td>
          </tr>
        </tbody>
      </v-simple-table>
    </v-card>
  </div>
</template>
<script>
export default {
  data(){
    return {
      IncotermList: [
        {
          code: "EXW",
          name: "工場渡",
          definition: " 売主の施設や指定場所(工場、倉庫など)において約定品を買主の処分に委ねたときに、売主の引渡義が完了する。 売主は引き取りの⾞両に積み込まず、輸出通関も⾏わない。"
        },
        {
          code: "FCA",
          name: "運送人渡",
          definition: "指定場所において買主が指定した運送人に約定品を引渡したときに、売主の引渡義務が完了する。 輸出通関⼿続きは売主が⾏う。引渡場所が売主の施設内の場合、売主は積込みの責任を負う。 引渡場所がこれ以外の場合は、売主は荷卸しの責任を負わない。 買主が物品の受領のため運送人以外を指名した場合は、その者に委ねられた時点で引渡しが完了する。"
        },
        {
          code: "CPT",
          name: "輸送費込",
          definition: "約定品を売主が指定した運送人に引渡した時点で売主の引渡義務が完了するが、指定仕向地までの運送費⽤は売主が負する。 物品が運送人に引渡された後は、買主が⼀切の危険と以後の追加費⽤を負する。輸出通関⼿続きは売主が⾏う。"
        },
        {
          code: "CIP",
          name: "輸送費保険料込",
          definition: "売主の引渡義務はCPTと同じだが、売主は約定品の指定仕向地までの運送費⽤および貨物運送保険料を負する。 CIP条件においては最⼩保の保険だけを取得することを要求されている。輸出通関⼿続きは売主が⾏う。"
        },
        {
          code: "DAP",
          name: "仕向地持込渡",
          definition: "指定仕向地において荷卸しの準備が出来ている到着した輸送⼿段の上で物品が買主の処分に委ねられた時、 売主が引渡の義務(危険移転)を果たす。輸出通関⼿続きは売主が⾏うが、輸⼊通関の義務はない。"
        },
        {
          code: "DPU",
          name: "荷卸込持込渡",
          definition: "指定仕向地で物品が輸送⼿段から荷卸しされた後買主の処分に委ねられた時、売主が引渡義務(危険移転)を果たす。 輸出通関⼿続きは売主が⾏う。 "
        },
        {
          code: "DDP",
          name: "関税込持込渡",
          definition: "物品が指定仕向地において荷卸しの準備が出来ている到着した輸送⼿段の上で輸⼊通関を済ませ、 買主の処分に委ねられた時、売主が引渡しの義務(危険移転)を果たす。輸出⼊通関⼀切の義務を負う。 関税に付随する付加価値税(内国消費税等)も売主勘定である"
        },
        {
          code: "FAS",
          name: "船側渡",
          definition: "約定品を指定船積港の本船の船側に当該港の慣習に沿って置いた時点で売主の引渡義務が完了し、 買主はその時から物品の⼀切の費⽤及び減失・損傷の危険を負しなければならない。輸出通関⼿続きは売主が⾏う。"
        },
        {
          code: "FOB",
          name: "本船渡",
          definition: "約定品が指定船積港で本船上で物品を引き渡すか⼜は既にそのように引き渡した時点で売主の引渡義務が完了し、 買主はその時から物品の⼀切の費⽤及び減失・損傷の危険を負しなければならない。 輸出通関⼿続きは売主が⾏う。"
        },
        {
          code: "CFR",
          name: "運賃込",
          definition: "売主の引渡義務はFOBと同じだが、売主は約定品を指定仕向港まで運送するための費⽤を負する。 輸出通関⼿続きは売主が⾏う。実務においては、伝統的な表現であるC&Fとして使⽤されているが、正しくはCFR。 物品の減失⼜は損傷は、物品が本船上に置かれた時⼜は引き渡された時に、危険負は売主から買主へ移転する。"
        },
        {
          code: "CIF",
          name: "運賃保険料込",
          definition: "売主の引渡義務はFOBと同じだが、売主は約定品の指定仕向港までの運賃を負する。 物品の減失⼜は損傷は、物品が本船上に置かれた時⼜は引き渡された時に、危険負は売主から買主へ移転する。 CIFにおいて売主は運送中の物品の減失・損傷についての買主の危険に対して、海上保険も負する。 CIF条件においては最⼩保の保険だけを取得することを要求されている。輸出通関⼿続きは売主が⾏う。"
        },
      ],
    }
  },

}
</script>

<style>

</style>